siennaprice/Sienna-Rose-Price-Labs/Lab1/Includes/MK20D5_simple.h
/*
** ###################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manuals:   K20P64M50SF0RM Rev. 1, Oct 2011
**                          K20P32M50SF0RM Rev. 1, Oct 2011
**                          K20P48M50SF0RM Rev. 1, Oct 2011
**
**     Version:             rev. 3.3, 2013-06-24
**
**     Abstract:
**         This header file implements peripheral memory map for MK20D5
**         processor.
**
**     Copyright: 1997 - 2013 Freescale, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 2.0 (2011-11-07)
**         Initial public version.
**     - rev. 2.1 (2011-12-13)
**         Removed registers for AIPS and AXBS modules.
**     - rev. 3.0 (2012-03-19)
**         PDB Peripheral register structure updated.
**         DMA Registers and bits for unsupported DMA channels removed.
**     - rev. 3.1 (2012-04-13)
**         Added new #define symbol MCU_MEM_MAP_VERSION_MINOR.
**         Added new #define symbols <peripheralType>_BASE_PTRS.
**     - rev. 3.2 (2013-04-05)
**         Changed start of doxygen comment.
**     - rev. 3.3 (2013-06-24)
**         NV_FOPT register - NMI_DIS bit added.
**
** ###################################################################
*/

/*!
 * @file MK20D5.h
 * @version 3.3
 * @date 2013-06-24
 * @brief Peripheral memory map for MK20D5
 *
 * This header file implements peripheral memory map for MK20D5 processor.
 */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MK20D5)  /* Check if memory map has not been already included */
#define MCU_MK20D5

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error MK20D5 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG(Reg,Bit) (*((uint32_t volatile*)(0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum {
  INT_Initial_Stack_Pointer    = 0,                /**< Initial stack pointer */
  INT_Initial_Program_Counter  = 1,                /**< Initial program counter */
  INT_NMI                      = 2,                /**< Non-maskable interrupt */
  INT_Hard_Fault               = 3,                /**< Hard fault exception */
  INT_Mem_Manage_Fault         = 4,                /**< Memory Manage Fault */
  INT_Bus_Fault                = 5,                /**< Bus fault exception */
  INT_Usage_Fault              = 6,                /**< Usage fault exception */
  INT_Reserved7                = 7,                /**< Reserved interrupt 7 */
  INT_Reserved8                = 8,                /**< Reserved interrupt 8 */
  INT_Reserved9                = 9,                /**< Reserved interrupt 9 */
  INT_Reserved10               = 10,               /**< Reserved interrupt 10 */
  INT_SVCall                   = 11,               /**< A supervisor call exception */
  INT_DebugMonitor             = 12,               /**< Debug Monitor */
  INT_Reserved13               = 13,               /**< Reserved interrupt 13 */
  INT_PendableSrvReq           = 14,               /**< PendSV exception - request for system level service */
  INT_SysTick                  = 15,               /**< SysTick interrupt */
  INT_DMA0                     = 16,               /**< DMA channel 0 transfer complete interrupt */
  INT_DMA1                     = 17,               /**< DMA channel 1 transfer complete interrupt */
  INT_DMA2                     = 18,               /**< DMA channel 2 transfer complete interrupt */
  INT_DMA3                     = 19,               /**< DMA channel 3 transfer complete interrupt */
  INT_DMA_Error                = 20,               /**< DMA error interrupt */
  INT_Reserved21               = 21,               /**< Reserved interrupt 21 */
  INT_FTFL                     = 22,               /**< FTFL interrupt */
  INT_Read_Collision           = 23,               /**< Read collision interrupt */
  INT_LVD_LVW                  = 24,               /**< Low Voltage Detect, Low Voltage Warning */
  INT_LLW                      = 25,               /**< Low Leakage Wakeup */
  INT_Watchdog                 = 26,               /**< WDOG interrupt */
  INT_I2C0                     = 27,               /**< I2C0 interrupt */
  INT_SPI0                     = 28,               /**< SPI0 interrupt */
  INT_I2S0_Tx                  = 29,               /**< I2S0 transmit interrupt */
  INT_I2S0_Rx                  = 30,               /**< I2S0 receive interrupt */
  INT_UART0_LON                = 31,               /**< UART0 LON interrupt */
  INT_UART0_RX_TX              = 32,               /**< UART0 receive/transmit interrupt */
  INT_UART0_ERR                = 33,               /**< UART0 error interrupt */
  INT_UART1_RX_TX              = 34,               /**< UART1 receive/transmit interrupt */
  INT_UART1_ERR                = 35,               /**< UART1 error interrupt */
  INT_UART2_RX_TX              = 36,               /**< UART2 receive/transmit interrupt */
  INT_UART2_ERR                = 37,               /**< UART2 error interrupt */
  INT_ADC0                     = 38,               /**< ADC0 interrupt */
  INT_CMP0                     = 39,               /**< CMP0 interrupt */
  INT_CMP1                     = 40,               /**< CMP1 interrupt */
  INT_FTM0                     = 41,               /**< FTM0 fault, overflow and channels interrupt */
  INT_FTM1                     = 42,               /**< FTM1 fault, overflow and channels interrupt */
  INT_CMT                      = 43,               /**< CMT interrupt */
  INT_RTC                      = 44,               /**< RTC interrupt */
  INT_RTC_Seconds              = 45,               /**< RTC seconds interrupt */
  INT_PIT0                     = 46,               /**< PIT timer channel 0 interrupt */
  INT_PIT1                     = 47,               /**< PIT timer channel 1 interrupt */
  INT_PIT2                     = 48,               /**< PIT timer channel 2 interrupt */
  INT_PIT3                     = 49,               /**< PIT timer channel 3 interrupt */
  INT_PDB0                     = 50,               /**< PDB0 interrupt */
  INT_USB0                     = 51,               /**< USB0 interrupt */
  INT_USBDCD                   = 52,               /**< USBDCD interrupt */
  INT_TSI0                     = 53,               /**< TSI0 interrupt */
  INT_MCG                      = 54,               /**< MCG interrupt */
  INT_LPTimer                  = 55,               /**< LPTimer interrupt */
  INT_PORTA                    = 56,               /**< Port A interrupt */
  INT_PORTB                    = 57,               /**< Port B interrupt */
  INT_PORTC                    = 58,               /**< Port C interrupt */
  INT_PORTD                    = 59,               /**< Port D interrupt */
  INT_PORTE                    = 60,               /**< Port E interrupt */
  INT_SWI                      = 61                /**< Software interrupt */
} IRQInterruptIndex;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Peripheral type defines
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_defines Peripheral type defines
 * @{
 */


