siennaprice/Sienna-Rose-Price-Labs/Lab1/Includes/MK20D5_simple.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_defines */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define PDB_CHC1_REG(base,index)                 PDB_C1_REG(base,index)
#define PDB_CHDLY0_REG(base,index)               PDB_DLY_REG(base,index,0)
#define PDB_CHDLY1_REG(base,index)               PDB_DLY_REG(base,index,1)
#define PDB_CHC1_EN_MASK                         PDB_C1_EN_MASK
#define PDB_CHC1_EN_SHIFT                        PDB_C1_EN_SHIFT
#define PDB_CHC1_EN(x)                           PDB_C1_EN(x)
#define PDB_CHC1_TOS_MASK                        PDB_C1_TOS_MASK
#define PDB_CHC1_TOS_SHIFT                       PDB_C1_TOS_SHIFT
#define PDB_CHC1_TOS(x)                          PDB_C1_TOS(x)
#define PDB_CHC1_BB_MASK                         PDB_C1_BB_MASK
#define PDB_CHC1_BB_SHIFT                        PDB_C1_BB_SHIFT
#define PDB_CHC1_BB(x)                           PDB_C1_BB(x)
#define PDB_CHDLY0_DLY_MASK                      PDB_DLY_DLY_MASK
#define PDB_CHDLY0_DLY_SHIFT                     PDB_DLY_DLY_SHIFT
#define PDB_CHDLY0_DLY(x)                        PDB_DLY_DLY(x)
#define PDB_CHDLY1_DLY_MASK                      PDB_DLY_DLY_MASK
#define PDB_CHDLY1_DLY_SHIFT                     PDB_DLY_DLY_SHIFT
#define PDB_CHDLY1_DLY(x)                        PDB_DLY_DLY(x)
#define PDB0_CHC1(index)                         PDB0_C1(index)
#define PDB0_CHDLY0(index)                       PDB0_DLY(index,0)
#define PDB0_CHDLY1(index)                       PDB0_DLY(index,1)

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_MK20D5) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0300u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0300u) */
#endif  /* #if !defined(MCU_MK20D5) */

/* MK20D5.h, eof. */
